app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts"
---
  def index
    @posts = Post.all

INSERT INTO "posts" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "My post title"], ["description", "My post description"], ["created_at", "2019-02-01 11:56:41.306429"], ["updated_at", "2019-02-01 11:56:41.306429"]]
---
  def create
    Post.create(title: params[:post][:title], description: params[:post][:description])

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
---
def set_post
  @post = Post.find(params[:id])